Revit 2027 API
BuiltInFailures.SketchFailures.RailingNotConnectedError Property
 The Railing line must be a single connected Sketch. If you want separate pieces of Railing, create two or more separate Railings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailingNotConnectedError { get; }
Public Shared ReadOnly Property RailingNotConnectedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailingNotConnectedError {
	FailureDefinitionId^ get ();
}
static member RailingNotConnectedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace